In [27]:
import pandas as pd
import numpy as np

Reading the data:

In [28]:
df = pd.read_csv("E:\Guvi\Projects\Inventory forecasting\\train 2.csv")
df

              date  store  item  sales
0       2013-01-01      1     1     13
1       2013-01-02      1     1     11
2       2013-01-03      1     1     14
3       2013-01-04      1     1     13
4       2013-01-05      1     1     10
...            ...    ...   ...    ...
912995  2017-12-27     10    50     63
912996  2017-12-28     10    50     59
912997  2017-12-29     10    50     74
912998  2017-12-30     10    50     62
912999  2017-12-31     10    50     82

[913000 rows x 4 columns]

Exploratory Data Analysis(EDA)

In [29]:
df.nunique()

date     1826
store      10
item       50
sales     213
dtype: int64

findings: 
We can see that the data is clean of outliers and duplicates. Since, there will be 
1. 1826 days in 5 years period 
2. As per the data we have 10 unique stores and 50 unique products. 
3. We can not tell whether all the values in sales are right/wrong.

In [30]:
df.dtypes

date     object
store     int64
item      int64
sales     int64
dtype: object

Finding: We can see that all the columns are in 'int64' datatype other than date which is in 'object' datatype.

In [31]:
df['date'] = pd.to_datetime(df['date'])
df.dtypes

date     datetime64[ns]
store             int64
item              int64
sales             int64
dtype: object

Changed date column to 'datetime' format for better interpretation.

In [32]:
print(df)

             date  store  item  sales
0      2013-01-01      1     1     13
1      2013-01-02      1     1     11
2      2013-01-03      1     1     14
3      2013-01-04      1     1     13
4      2013-01-05      1     1     10
...           ...    ...   ...    ...
912995 2017-12-27     10    50     63
912996 2017-12-28     10    50     59
912997 2017-12-29     10    50     74
912998 2017-12-30     10    50     62
912999 2017-12-31     10    50     82

[913000 rows x 4 columns]

In [33]:
x = df.groupby(['date','store','item']).sum()
x

                       sales
date       store item
2013-01-01 1     1        13
                 2        33
                 3        15
                 4        10
                 5        11
...                      ...
2017-12-31 10    46       70
                 47       22
                 48       60
                 49       42
                 50       82

[913000 rows x 1 columns]

In [34]:
df2 = df.groupby(['date','item'], as_index = False).sales.sum()
df2

            date  item  sales
0     2013-01-01     1    133
1     2013-01-01     2    327
2     2013-01-01     3    172
3     2013-01-01     4    102
4     2013-01-01     5     83
...          ...   ...    ...
91295 2017-12-31    46    605
91296 2017-12-31    47    211
91297 2017-12-31    48    494
91298 2017-12-31    49    285
91299 2017-12-31    50    626

[91300 rows x 3 columns]

In [35]:
df3 = df2.groupby(['item','date'],as_index = False).sales.sum()

In [36]:
df3

       item       date  sales
0         1 2013-01-01    133
1         1 2013-01-02     99
2         1 2013-01-03    127
3         1 2013-01-04    145
4         1 2013-01-05    149
...     ...        ...    ...
91295    50 2017-12-27    511
91296    50 2017-12-28    587
91297    50 2017-12-29    596
91298    50 2017-12-30    612
91299    50 2017-12-31    626

[91300 rows x 3 columns]

In [37]:
# df_item_1 = df3[df3['item']==1]
# df_item_1

In [52]:
df_items = []
for i in range(0,51):
    df_item_i = df3[df3['item']==i]
    df_items.append(df_item_i)

In [38]:
# df3['demand'] = df2.sales.rolling(window = 90).sum()

In [39]:
# df3

In [40]:
# df3.iloc[89:]

In [49]:
empty_var = ['df_item_{}'.format(i) for i in range(1,51)]

In [50]:
print(empty_var)

['df_item_1', 'df_item_2', 'df_item_3', 'df_item_4', 'df_item_5', 'df_item_6', 'df_item_7', 'df_item_8', 'df_item_9', 'df_item_10', 'df_item_11', 'df_item_12', 'df_item_13', 'df_item_14', 'df_item_15', 'df_item_16', 'df_item_17', 'df_item_18', 'df_item_19', 'df_item_20', 'df_item_21', 'df_item_22', 'df_item_23', 'df_item_24', 'df_item_25', 'df_item_26', 'df_item_27', 'df_item_28', 'df_item_29', 'df_item_30', 'df_item_31', 'df_item_32', 'df_item_33', 'df_item_34', 'df_item_35', 'df_item_36', 'df_item_37', 'df_item_38', 'df_item_39', 'df_item_40', 'df_item_41', 'df_item_42', 'df_item_43', 'df_item_44', 'df_item_45', 'df_item_46', 'df_item_47', 'df_item_48', 'df_item_49', 'df_item_50']

In [54]:
df_items

[Empty DataFrame
 Columns: [item, date, sales]
 Index: [],
       item       date  sales
 0        1 2013-01-01    133
 1        1 2013-01-02     99
 2        1 2013-01-03    127
 3        1 2013-01-04    145
 4        1 2013-01-05    149
 ...    ...        ...    ...
 1821     1 2017-12-27    154
 1822     1 2017-12-28    178
 1823     1 2017-12-29    207
 1824     1 2017-12-30    236
 1825     1 2017-12-31    227

 [1826 rows x 3 columns],
       item       date  sales
 1826     2 2013-01-01    327
 1827     2 2013-01-02    279
 1828     2 2013-01-03    304
 1829     2 2013-01-04    359
 1830     2 2013-01-05    377
 ...    ...        ...    ...
 3647     2 2017-12-27    500
 3648     2 2017-12-28    495
 3649     2 2017-12-29    515
 3650     2 2017-12-30    538
 3651     2 2017-12-31    634

 [1826 rows x 3 columns],
       item       date  sales
 3652     3 2013-01-01    172
 3653     3 2013-01-02    213
 3654     3 2013-01-03    193
 3655     3 2013-01-04    218
 3656     3 2013-01-05    217
 ...    ...        ...    ...
 5473     3 2017-12-27    282
 5474     3 2017-12-28    298
 5475     3 2017-12-29    332
 5476     3 2017-12-30    342
 5477     3 2017-12-31    402

 [1826 rows x 3 columns],
       item       date  sales
 5478     4 2013-01-01    102
 5479     4 2013-01-02    110
 5480     4 2013-01-03    112
 5481     4 2013-01-04    138
 5482     4 2013-01-05    144
 ...    ...        ...    ...
 7299     4 2017-12-27    172
 7300     4 2017-12-28    190
 7301     4 2017-12-29    192
 7302     4 2017-12-30    211
 7303     4 2017-12-31    228

 [1826 rows x 3 columns],
       item       date  sales
 7304     5 2013-01-01     83
 7305     5 2013-01-02     81
 7306     5 2013-01-03     96
 7307     5 2013-01-04    108
 7308     5 2013-01-05    100
 ...    ...        ...    ...
 9125     5 2017-12-27    148
 9126     5 2017-12-28    157
 9127     5 2017-12-29    177
 9128     5 2017-12-30    173
 9129     5 2017-12-31    188

 [1826 rows x 3 columns],
        item       date  sales
 9130      6 2013-01-01    288
 9131      6 2013-01-02    310
 9132      6 2013-01-03    309
 9133      6 2013-01-04    343
 9134      6 2013-01-05    343
 ...     ...        ...    ...
 10951     6 2017-12-27    406
 10952     6 2017-12-28    506
 10953     6 2017-12-29    530
 10954     6 2017-12-30    532
 10955     6 2017-12-31    565

 [1826 rows x 3 columns],
        item       date  sales
 10956     7 2013-01-01    278
 10957     7 2013-01-02    291
 10958     7 2013-01-03    324
 10959     7 2013-01-04    335
 10960     7 2013-01-05    377
 ...     ...        ...    ...
 12777     7 2017-12-27    457
 12778     7 2017-12-28    499
 12779     7 2017-12-29    532
 12780     7 2017-12-30    609
 12781     7 2017-12-31    610

 [1826 rows x 3 columns],
        item       date  sales
 12782     8 2013-01-01    416
 12783     8 2013-01-02    386
 12784     8 2013-01-03    398
 12785     8 2013-01-04    430
 12786     8 2013-01-05    481
 ...     ...        ...    ...
 14603     8 2017-12-27    579
 14604     8 2017-12-28    644
 14605     8 2017-12-29    648
 14606     8 2017-12-30    784
 14607     8 2017-12-31    823

 [1826 rows x 3 columns],
        item       date  sales
 14608     9 2013-01-01    245
 14609     9 2013-01-02    225
 14610     9 2013-01-03    265
 14611     9 2013-01-04    313
 14612     9 2013-01-05    319
 ...     ...        ...    ...
 16429     9 2017-12-27    387
 16430     9 2017-12-28    420
 16431     9 2017-12-29    494
 16432     9 2017-12-30    492
 16433     9 2017-12-31    544

 [1826 rows x 3 columns],
        item       date  sales
 16434    10 2013-01-01    378
 16435    10 2013-01-02    397
 16436    10 2013-01-03    388
 16437    10 2013-01-04    462
 16438    10 2013-01-05    449
 ...     ...        ...    ...
 18255    10 2017-12-27    546
 18256    10 2017-12-28    609
 18257    10 2017-12-29    617
 18258    10 2017-12-30    698
 18259    10 2017-12-31    721

 [1826 rows x 3 columns],
        item       date  sales
 18260    11 2013-01-01    369
 18261    11 2013-01-02    396
 18262    11 2013-01-03    398
 18263    11 2013-01-04    460
 18264    11 2013-01-05    417
 ...     ...        ...    ...
 20081    11 2017-12-27    576
 20082    11 2017-12-28    589
 20083    11 2017-12-29    657
 20084    11 2017-12-30    710
 20085    11 2017-12-31    700

 [1826 rows x 3 columns],
        item       date  sales
 20086    12 2013-01-01    369
 20087    12 2013-01-02    326
 20088    12 2013-01-03    384
 20089    12 2013-01-04    435
 20090    12 2013-01-05    438
 ...     ...        ...    ...
 21907    12 2017-12-27    551
 21908    12 2017-12-28    593
 21909    12 2017-12-29    654
 21910    12 2017-12-30    682
 21911    12 2017-12-31    691

 [1826 rows x 3 columns],
        item       date  sales
 21912    13 2013-01-01    444
 21913    13 2013-01-02    434
 21914    13 2013-01-03    455
 21915    13 2013-01-04    474
 21916    13 2013-01-05    493
 ...     ...        ...    ...
 23733    13 2017-12-27    689
 23734    13 2017-12-28    736
 23735    13 2017-12-29    736
 23736    13 2017-12-30    801
 23737    13 2017-12-31    849

 [1826 rows x 3 columns],
        item       date  sales
 23738    14 2013-01-01    310
 23739    14 2013-01-02    363
 23740    14 2013-01-03    337
 23741    14 2013-01-04    371
 23742    14 2013-01-05    366
 ...     ...        ...    ...
 25559    14 2017-12-27    468
 25560    14 2017-12-28    522
 25561    14 2017-12-29    513
 25562    14 2017-12-30    534
 25563    14 2017-12-31    576

 [1826 rows x 3 columns],
        item       date  sales
 25564    15 2013-01-01    453
 25565    15 2013-01-02    442
 25566    15 2013-01-03    487
 25567    15 2013-01-04    533
 25568    15 2013-01-05    604
 ...     ...        ...    ...
 27385    15 2017-12-27    670
 27386    15 2017-12-28    675
 27387    15 2017-12-29    778
 27388    15 2017-12-30    864
 27389    15 2017-12-31    836

 [1826 rows x 3 columns],
        item       date  sales
 27390    16 2013-01-01    144
 27391    16 2013-01-02    136
 27392    16 2013-01-03    137
 27393    16 2013-01-04    141
 27394    16 2013-01-05    145
 ...     ...        ...    ...
 29211    16 2017-12-27    185
 29212    16 2017-12-28    201
 29213    16 2017-12-29    213
 29214    16 2017-12-30    231
 29215    16 2017-12-31    282

 [1826 rows x 3 columns],
        item       date  sales
 29216    17 2013-01-01    171
 29217    17 2013-01-02    181
 29218    17 2013-01-03    207
 29219    17 2013-01-04    195
 29220    17 2013-01-05    172
 ...     ...        ...    ...
 31037    17 2017-12-27    262
 31038    17 2017-12-28    271
 31039    17 2017-12-29    306
 31040    17 2017-12-30    274
 31041    17 2017-12-31    335

 [1826 rows x 3 columns],
        item       date  sales
 31042    18 2013-01-01    415
 31043    18 2013-01-02    419
 31044    18 2013-01-03    470
 31045    18 2013-01-04    513
 31046    18 2013-01-05    544
 ...     ...        ...    ...
 32863    18 2017-12-27    696
 32864    18 2017-12-28    704
 32865    18 2017-12-29    744
 32866    18 2017-12-30    783
 32867    18 2017-12-31    835

 [1826 rows x 3 columns],
        item       date  sales
 32868    19 2013-01-01    208
 32869    19 2013-01-02    208
 32870    19 2013-01-03    230
 32871    19 2013-01-04    238
 32872    19 2013-01-05    260
 ...     ...        ...    ...
 34689    19 2017-12-27    305
 34690    19 2017-12-28    337
 34691    19 2017-12-29    343
 34692    19 2017-12-30    395
 34693    19 2017-12-31    401

 [1826 rows x 3 columns],
        item       date  sales
 34694    20 2013-01-01    265
 34695    20 2013-01-02    235
 34696    20 2013-01-03    260
 34697    20 2013-01-04    269
 34698    20 2013-01-05    277
 ...     ...        ...    ...
 36515    20 2017-12-27    395
 36516    20 2017-12-28    387
 36517    20 2017-12-29    433
 36518    20 2017-12-30    442
 36519    20 2017-12-31    468

 [1826 rows x 3 columns],
        item       date  sales
 36520    21 2013-01-01    222
 36521    21 2013-01-02    242
 36522    21 2013-01-03    243
 36523    21 2013-01-04    246
 36524    21 2013-01-05    243
 ...     ...        ...    ...
 38341    21 2017-12-27    328
 38342    21 2017-12-28    330
 38343    21 2017-12-29    378
 38344    21 2017-12-30    379
 38345    21 2017-12-31    408

 [1826 rows x 3 columns],
        item       date  sales
 38346    22 2013-01-01    459
 38347    22 2013-01-02    450
 38348    22 2013-01-03    431
 38349    22 2013-01-04    465
 38350    22 2013-01-05    459
 ...     ...        ...    ...
 40167    22 2017-12-27    596
 40168    22 2017-12-28    672
 40169    22 2017-12-29    758
 40170    22 2017-12-30    750
 40171    22 2017-12-31    843

 [1826 rows x 3 columns],
        item       date  sales
 40172    23 2013-01-01    146
 40173    23 2013-01-02    163
 40174    23 2013-01-03    121
 40175    23 2013-01-04    173
 40176    23 2013-01-05    212
 ...     ...        ...    ...
 41993    23 2017-12-27    233
 41994    23 2017-12-28    248
 41995    23 2017-12-29    258
 41996    23 2017-12-30    258
 41997    23 2017-12-31    303

 [1826 rows x 3 columns],
        item       date  sales
 41998    24 2013-01-01    349
 41999    24 2013-01-02    324
 42000    24 2013-01-03    317
 42001    24 2013-01-04    368
 42002    24 2013-01-05    364
 ...     ...        ...    ...
 43819    24 2017-12-27    475
 43820    24 2017-12-28    555
 43821    24 2017-12-29    599
 43822    24 2017-12-30    678
 43823    24 2017-12-31    640

 [1826 rows x 3 columns],
        item       date  sales
 43824    25 2013-01-01    447
 43825    25 2013-01-02    432
 43826    25 2013-01-03    481
 43827    25 2013-01-04    450
 43828    25 2013-01-05    510
 ...     ...        ...    ...
 45645    25 2017-12-27    665
 45646    25 2017-12-28    680
 45647    25 2017-12-29    718
 45648    25 2017-12-30    767
 45649    25 2017-12-31    898

 [1826 rows x 3 columns],
        item       date  sales
 45650    26 2013-01-01    211
 45651    26 2013-01-02    260
 45652    26 2013-01-03    296
 45653    26 2013-01-04    303
 45654    26 2013-01-05    298
 ...     ...        ...    ...
 47471    26 2017-12-27    395
 47472    26 2017-12-28    397
 47473    26 2017-12-29    412
 47474    26 2017-12-30    420
 47475    26 2017-12-31    494

 [1826 rows x 3 columns],
        item       date  sales
 47476    27 2013-01-01    111
 47477    27 2013-01-02    134
 47478    27 2013-01-03    120
 47479    27 2013-01-04    135
 47480    27 2013-01-05    118
 ...     ...        ...    ...
 49297    27 2017-12-27    173
 49298    27 2017-12-28    194
 49299    27 2017-12-29    181
 49300    27 2017-12-30    223
 49301    27 2017-12-31    220

 [1826 rows x 3 columns],
        item       date  sales
 49302    28 2013-01-01    456
 49303    28 2013-01-02    474
 49304    28 2013-01-03    519
 49305    28 2013-01-04    527
 49306    28 2013-01-05    575
 ...     ...        ...    ...
 51123    28 2017-12-27    680
 51124    28 2017-12-28    743
 51125    28 2017-12-29    776
 51126    28 2017-12-30    901
 51127    28 2017-12-31    870

 [1826 rows x 3 columns],
        item       date  sales
 51128    29 2013-01-01    351
 51129    29 2013-01-02    360
 51130    29 2013-01-03    413
 51131    29 2013-01-04    406
 51132    29 2013-01-05    468
 ...     ...        ...    ...
 52949    29 2017-12-27    520
 52950    29 2017-12-28    531
 52951    29 2017-12-29    655
 52952    29 2017-12-30    689
 52953    29 2017-12-31    700

 [1826 rows x 3 columns],
        item       date  sales
 52954    30 2013-01-01    219
 52955    30 2013-01-02    202
 52956    30 2013-01-03    237
 52957    30 2013-01-04    278
 52958    30 2013-01-05    255
 ...     ...        ...    ...
 54775    30 2017-12-27    313
 54776    30 2017-12-28    330
 54777    30 2017-12-29    345
 54778    30 2017-12-30    391
 54779    30 2017-12-31    394

 [1826 rows x 3 columns],
        item       date  sales
 54780    31 2013-01-01    337
 54781    31 2013-01-02    323
 54782    31 2013-01-03    305
 54783    31 2013-01-04    368
 54784    31 2013-01-05    356
 ...     ...        ...    ...
 56601    31 2017-12-27    469
 56602    31 2017-12-28    484
 56603    31 2017-12-29    557
 56604    31 2017-12-30    530
 56605    31 2017-12-31    610

 [1826 rows x 3 columns],
        item       date  sales
 56606    32 2013-01-01    237
 56607    32 2013-01-02    215
 56608    32 2013-01-03    259
 56609    32 2013-01-04    261
 56610    32 2013-01-05    240
 ...     ...        ...    ...
 58427    32 2017-12-27    349
 58428    32 2017-12-28    391
 58429    32 2017-12-29    422
 58430    32 2017-12-30    432
 58431    32 2017-12-31    434

 [1826 rows x 3 columns],
        item       date  sales
 58432    33 2013-01-01    384
 58433    33 2013-01-02    345
 58434    33 2013-01-03    388
 58435    33 2013-01-04    415
 58436    33 2013-01-05    414
 ...     ...        ...    ...
 60253    33 2017-12-27    505
 60254    33 2017-12-28    578
 60255    33 2017-12-29    569
 60256    33 2017-12-30    643
 60257    33 2017-12-31    722

 [1826 rows x 3 columns],
        item       date  sales
 60258    34 2013-01-01    149
 60259    34 2013-01-02    116
 60260    34 2013-01-03    164
 60261    34 2013-01-04    150
 60262    34 2013-01-05    145
 ...     ...        ...    ...
 62079    34 2017-12-27    204
 62080    34 2017-12-28    203
 62081    34 2017-12-29    207
 62082    34 2017-12-30    246
 62083    34 2017-12-31    280

 [1826 rows x 3 columns],
        item       date  sales
 62084    35 2013-01-01    350
 62085    35 2013-01-02    345
 62086    35 2013-01-03    316
 62087    35 2013-01-04    389
 62088    35 2013-01-05    448
 ...     ...        ...    ...
 63905    35 2017-12-27    530
 63906    35 2017-12-28    499
 63907    35 2017-12-29    585
 63908    35 2017-12-30    640
 63909    35 2017-12-31    647

 [1826 rows x 3 columns],
        item       date  sales
 63910    36 2013-01-01    431
 63911    36 2013-01-02    391
 63912    36 2013-01-03    443
 63913    36 2013-01-04    466
 63914    36 2013-01-05    453
 ...     ...        ...    ...
 65731    36 2017-12-27    630
 65732    36 2017-12-28    664
 65733    36 2017-12-29    727
 65734    36 2017-12-30    752
 65735    36 2017-12-31    817

 [1826 rows x 3 columns],
        item       date  sales
 65736    37 2013-01-01    157
 65737    37 2013-01-02    151
 65738    37 2013-01-03    158
 65739    37 2013-01-04    174
 65740    37 2013-01-05    189
 ...     ...        ...    ...
 67557    37 2017-12-27    215
 67558    37 2017-12-28    249
 67559    37 2017-12-29    273
 67560    37 2017-12-30    260
 67561    37 2017-12-31    263

 [1826 rows x 3 columns],
        item       date  sales
 67562    38 2013-01-01    381
 67563    38 2013-01-02    432
 67564    38 2013-01-03    437
 67565    38 2013-01-04    494
 67566    38 2013-01-05    509
 ...     ...        ...    ...
 69383    38 2017-12-27    592
 69384    38 2017-12-28    693
 69385    38 2017-12-29    782
 69386    38 2017-12-30    788
 69387    38 2017-12-31    821

 [1826 rows x 3 columns],
        item       date  sales
 69388    39 2013-01-01    248
 69389    39 2013-01-02    225
 69390    39 2013-01-03    254
 69391    39 2013-01-04    284
 69392    39 2013-01-05    283
 ...     ...        ...    ...
 71209    39 2017-12-27    313
 71210    39 2017-12-28    362
 71211    39 2017-12-29    400
 71212    39 2017-12-30    429
 71213    39 2017-12-31    414

 [1826 rows x 3 columns],
        item       date  sales
 71214    40 2013-01-01    179
 71215    40 2013-01-02    145
 71216    40 2013-01-03    172
 71217    40 2013-01-04    184
 71218    40 2013-01-05    174
 ...     ...        ...    ...
 73035    40 2017-12-27    256
 73036    40 2017-12-28    264
 73037    40 2017-12-29    275
 73038    40 2017-12-30    258
 73039    40 2017-12-31    305

 [1826 rows x 3 columns],
        item       date  sales
 73040    41 2013-01-01    103
 73041    41 2013-01-02    132
 73042    41 2013-01-03    131
 73043    41 2013-01-04    122
 73044    41 2013-01-05    142
 ...     ...        ...    ...
 74861    41 2017-12-27    176
 74862    41 2017-12-28    172
 74863    41 2017-12-29    185
 74864    41 2017-12-30    177
 74865    41 2017-12-31    246

 [1826 rows x 3 columns],
        item       date  sales
 74866    42 2013-01-01    195
 74867    42 2013-01-02    215
 74868    42 2013-01-03    215
 74869    42 2013-01-04    224
 74870    42 2013-01-05    243
 ...     ...        ...    ...
 76687    42 2017-12-27    264
 76688    42 2017-12-28    346
 76689    42 2017-12-29    304
 76690    42 2017-12-30    338
 76691    42 2017-12-31    364

 [1826 rows x 3 columns],
        item       date  sales
 76692    43 2013-01-01    253
 76693    43 2013-01-02    255
 76694    43 2013-01-03    306
 76695    43 2013-01-04    323
 76696    43 2013-01-05    309
 ...     ...        ...    ...
 78513    43 2017-12-27    381
 78514    43 2017-12-28    415
 78515    43 2017-12-29    457
 78516    43 2017-12-30    507
 78517    43 2017-12-31    487

 [1826 rows x 3 columns],
        item       date  sales
 78518    44 2013-01-01    154
 78519    44 2013-01-02    165
 78520    44 2013-01-03    170
 78521    44 2013-01-04    189
 78522    44 2013-01-05    202
 ...     ...        ...    ...
 80339    44 2017-12-27    233
 80340    44 2017-12-28    248
 80341    44 2017-12-29    277
 80342    44 2017-12-30    266
 80343    44 2017-12-31    299

 [1826 rows x 3 columns],
        item       date  sales
 80344    45 2013-01-01    396
 80345    45 2013-01-02    393
 80346    45 2013-01-03    459
 80347    45 2013-01-04    450
 80348    45 2013-01-05    533
 ...     ...        ...    ...
 82165    45 2017-12-27    681
 82166    45 2017-12-28    707
 82167    45 2017-12-29    724
 82168    45 2017-12-30    762
 82169    45 2017-12-31    805

 [1826 rows x 3 columns],
        item       date  sales
 82170    46 2013-01-01    319
 82171    46 2013-01-02    316
 82172    46 2013-01-03    325
 82173    46 2013-01-04    351
 82174    46 2013-01-05    360
 ...     ...        ...    ...
 83991    46 2017-12-27    487
 83992    46 2017-12-28    473
 83993    46 2017-12-29    548
 83994    46 2017-12-30    566
 83995    46 2017-12-31    605

 [1826 rows x 3 columns],
        item       date  sales
 83996    47 2013-01-01    116
 83997    47 2013-01-02    118
 83998    47 2013-01-03    104
 83999    47 2013-01-04    128
 84000    47 2013-01-05    133
 ...     ...        ...    ...
 85817    47 2017-12-27    171
 85818    47 2017-12-28    188
 85819    47 2017-12-29    213
 85820    47 2017-12-30    190
 85821    47 2017-12-31    211

 [1826 rows x 3 columns],
        item       date  sales
 85822    48 2013-01-01    277
 85823    48 2013-01-02    281
 85824    48 2013-01-03    280
 85825    48 2013-01-04    296
 85826    48 2013-01-05    344
 ...     ...        ...    ...
 87643    48 2017-12-27    374
 87644    48 2017-12-28    395
 87645    48 2017-12-29    496
 87646    48 2017-12-30    502
 87647    48 2017-12-31    494

 [1826 rows x 3 columns],
        item       date  sales
 87648    49 2013-01-01    159
 87649    49 2013-01-02    159
 87650    49 2013-01-03    187
 87651    49 2013-01-04    184
 87652    49 2013-01-05    179
 ...     ...        ...    ...
 89469    49 2017-12-27    231
 89470    49 2017-12-28    276
 89471    49 2017-12-29    237
 89472    49 2017-12-30    303
 89473    49 2017-12-31    285

 [1826 rows x 3 columns],
        item       date  sales
 89474    50 2013-01-01    330
 89475    50 2013-01-02    384
 89476    50 2013-01-03    356
 89477    50 2013-01-04    394
 89478    50 2013-01-05    407
 ...     ...        ...    ...
 91295    50 2017-12-27    511
 91296    50 2017-12-28    587
 91297    50 2017-12-29    596
 91298    50 2017-12-30    612
 91299    50 2017-12-31    626

 [1826 rows x 3 columns]]

In [55]:
map(df_items,empty_var)

In [58]:
empty_var[1]

'df_item_2'